## Relatório de Análise 4

### Seleções e Frequências

In [58]:
import pandas as pd

In [59]:
dados = pd.read_csv("dados/aluguel_residencial.csv", sep = ';')
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
4,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
5,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
6,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,NaN,NaN
7,Casa de Condomínio,Ramos,2,2,0,65,1000.0,NaN,NaN
8,Apartamento,Centro,1,0,0,36,1200.0,NaN,NaN
9,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0

In [60]:
dados.shape

(22580, 9)

In [61]:
# Selecione somente os imóveis classificados com tipo "Apartamento"
# ctrl + shift + - -> ajuda na hora de criar linhas de código para cada comentário
selecao = dados['Tipo'] == 'Apartamento'
n1 = dados[selecao]
n1 = dados[selecao].shape[0]
n1
# São 19532 apartamentos

19532

In [62]:
# Selecione os imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila'
selecao = (dados['Tipo'] == 'Casa')| (dados['Tipo'] == 'Casa de Condomínio') | (dados['Tipo'] == 'Casa de Vila')
n2 = dados[selecao].shape[0]
n2
# São 2212 Casas, Casas de Condomínio e Casas de Vila

2212

In [63]:
# Selecione os imóveis com área entre 60 e 100 metros quadrados, incluindo os limites
# 60 <= Area <= 100
selecao = (dados['Area'] >= 60) & (dados['Area'] <= 100)
n3 = dados[selecao].shape[0]
n3

8719

In [64]:
# Seleciona os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00
selecao = (dados['Quartos'] >= 4) & (dados['Valor'] < 2000)
n4 = dados[selecao].shape[0]
n4

41

In [65]:
print("N° de imóveis classificados com tipo 'Apartamento' -> {}".format(n1))
print("N° de imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila -> {}".format(n2))
print("N° de imóveis com área entre 60 e 100 metros quadrados, incluindo os limites -> {}".format(n3))
print("N° de imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00-> {}".format(n4))

N° de imóveis classificados com tipo 'Apartamento' -> 19532
N° de imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila -> 2212
N° de imóveis com área entre 60 e 100 metros quadrados, incluindo os limites -> 8719
N° de imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00-> 41

## Exercícios

In [66]:
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [67]:
# Crie um DataFrame somente com alunos aprovados
selecao = alunos['Aprovado'] == True
alunos_aprovados = alunos[selecao]

In [68]:
alunos_aprovados

    Nome  Idade Sexo  Notas  Aprovado
0    Ary     15    M    7.5      True
3   Beto     32    M   10.0      True
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [69]:
# Crie um DataFrame somente com as alunas aprovadas
selecao = (alunos['Aprovado'] == True) & (alunos['Sexo'] == 'F')
alunos_femininos_aprovados = alunos[selecao]

In [70]:
alunos_femininos_aprovados

    Nome  Idade Sexo  Notas  Aprovado
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [71]:
# Crie apenas uma visualização dos alunos com idade entre 10 e 20 anos ou com idade maior ou igual a 40 anos
# 10 < Idade < 20 ou Idade >= 40
selecao = (alunos['Idade'] > 10 ) & (alunos['Idade']<20) | (alunos['Idade'] >= 40)
alunos_idade = alunos[selecao]

In [72]:
alunos_idade

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
2   Denis     56    M    5.0     False
4   Bruna     42    F    8.2      True
6  Carlos     19    M    6.0     False

## Extra - Formas de Seleções

In [73]:
data = [(1,2,3,4),
        (5,6,7,8),
        (9,10,11,12),
        (13,14,15,16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [74]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [75]:
df['c1'] # Isso é um Series do Pandas

l1     1
l2     5
l3     9
l4    13
Name: c1, dtype: int64

In [76]:
# Selecionar 2 colunas
df[['c3', 'c1']] # Aqui já é um DataFrame

    c3  c1
l1   3   1
l2   7   5
l3  11   9
l4  15  13

In [77]:
# Selecionando todas as linhas
df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [78]:
# Selecionando da linha 2 em diante
df[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [79]:
# Selecionando as linhas 2 e 3
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12

In [80]:
# Fazer seleções a partir de rótulos das linhas
df.loc['l3']

c1     9
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [81]:
# Posso também selecionar uma linha
df.loc[['l3', 'l2']]

    c1  c2  c3  c4
l3   9  10  11  12
l2   5   6   7   8

In [82]:
df.loc['l1', 'c2']

2

In [83]:
# Usando o 'iloc' que seleciona a partir de índices numéricos
df.iloc[0,1]

2

In [84]:
df.loc[['l3', 'l1'], ['c4', 'c1']]

    c4  c1
l3  12   9
l1   4   1

In [85]:
# Fazendo a mesma coisa de cime com o iloc
df.iloc[[2,0], [3, 0]]

    c4  c1
l3  12   9
l1   4   1

## Exercícios Alunos Reprovados

In [86]:
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [103]:
# Selecionando alunos reprovados e restringindo as colunas utilizando loc()
selecao = alunos['Aprovado'] == False
alunos_reprovados = alunos.loc[selecao, ['Nome','Sexo', 'Idade']]

In [105]:
alunos_reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

In [107]:
# Selecionando Alunos reprovados e restringindo as colunas
selecao = alunos['Aprovado'] == False
reprovados = alunos[['Nome', 'Sexo', 'Idade']][selecao]
reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

In [109]:
# Crie uma nova visualização com 3 alunos mais novos
alunos.sort_values(by = ['Idade'], inplace = True)
alunos.iloc[:3]

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
6  Carlos     19    M    6.0     False
5    Dara     21    F    7.0      True

## O que aprendemos:

Formas de seleção e frequências
Seleção com a condição OR (|)
Seleção com a condição AND (&)
Como criar um Index com split()
Seleção por linha e coluna em um dataframe:
Utilizando os índices numéricos e os rótulos das linhas